
//#include<stdlib.h>
//#include<string.h>
//#include<stdio.h>
//#include<assert.h>//p判断指针是否为空
//#include "student.h"
//#define LEN 15//姓名和学号的最大字符数 
//#define N 50//最大学生人数
//// 结构体
//typedef struct {
//
//	char no[15];   //15位学号
//
//	char name[32]; //姓名
//
//	int price;     //成绩
//
//	int number;
//
//}Student;
//
//
//
////顺序表的定义
//
//typedef  struct {
//
//	Student* elem;     //指向数据元素的基地址
//
//	int  length;       //线性表的当前长度                                                           
//
//}SqList;
//
////链表的定义：
//
//typedef struct LNode {
//
//	Student   data;       //数据域
//
//	struct LNode* next;   //指针域
//
//}LNode, * LinkList;
//
//void menu()
//{
//	printf("\n\n");
//	printf("*****************************************************\n");
//	printf("*----------------------duoduo------------------------\n");
//	printf("*                 学生信息管理系统                  *\n");
//	printf("*****************************************************\n");
//	printf("********************系统功能菜单*********************\n");
//	printf("----------------------     --------------------------\n");
//	printf("*****************************************************\n");
//	printf("**    1、使用帮助       *     2、增加学生信息      **\n");
//	printf("*****************************************************\n");
//	printf("**    3、查询学生信息   *     4、删除学生信息      **\n");
//	printf("*****************************************************\n");
//	printf("**    5、保存当前信息   *     6、显示当前信息      **\n");
//	printf("*****************************************************\n");
//	printf("**    7、修改学生信息   *     8、刷新学生信息      **\n");
//	printf("*****************************************************\n");
//	printf("**    9、退出系统       *                          **\n");
//	printf("*************************                            \n");
//	printf("----------------------     --------------------------\n");
//
//}
//void help()
//{
//	printf("\n这是一个学生信息管理系统，为了帮助您更快的了解使用它，请先仔细阅读以下注意事项：\n");
//	printf("\n                  注意事项:                    \n ");
//	printf("\n       1、请根据提示进行操作！\n");
//	printf("\n       2、初次使用请先选择增加学生信息！\n");
//	printf("\n       3、修改或者增加学生信息后切记保存！\n");
//	printf("\n       4、如果数据有错误，请先修改再保存！\n");
//	printf("\n       5、若您之前使用过，下次进入系统请先刷新学生信息！\n");
//	printf("\n       6、在添加学生时，用两个字符代表不同的性别，比如男用‘M’代替,女用‘W’代替!\n");
//	printf("\n       7、保存或者刷新时，输入的文件名后缀请使用.txt,比如: stu.txt,系统会在源程序\n");
//	printf("\n          “学生管理系统.exe”的相同目录建立一个.txt文件来保存学生信息，您可以查看\n");
//	printf("\n          该文件，但非专业人员不要轻易改动，否则会造成刷新数据异常或刷新失败！\n");
//	printf("\n       8、学生信息包括：姓名、学号、性别、年龄、C语言成绩、高数成绩、英语成绩等！\n");
//	printf("\n       9、使用遇到任何问题请与我们联系，邮箱：ouyang_na_na@163.com\n");
//	printf("\n       10、最后感谢您的使用！\n");
//	system("pause");
//}
////交互
//void keyDown()
//{
//
//	int choice = 0;
//	scanf("%d", &choice);
//	switch (choice)
//	{
//	case 0:
//		printf("正常退出！\n");
//		system("pause");
//		exit(0);
//		break;
//	case 1:
//		printf("....................录入信息....................");
//		break;
//	case 2:
//		printf("....................修改信息....................");
//		break;
//	case 3:
//		printf("....................删除信息....................");
//		break;
//	case 4:
//		printf("....................查找信息....................");
//		break;
//	case 5:
//		printf("....................浏览信息....................");
//		break;
//	default:
//		printf("....................输入错误，请重新输入....................");
//		break;
//	
//	
//	}
//
//}


